Repository: real-Hafez/lose_weight_eat_healthy
Catalog: lib/l10n/intl_*.arb
Languages: ar

# skipButton
source: Skip
ar: تخطي

# newAccount
source: Create New Account
ar: إنشاء حساب جديد

# mainTextFirstOnboardingPage
source: Find Your Perfect Cardio Routine
ar: ابحث عن روتين الكارديو المثالي لك

# subTextFirstOnboardingPage
source: Browse videos that match your fitness level and help you reach your cardio goals.
ar: تصفح الفيديوهات التي تناسب مستوى لياقتك وتساعدك على تحقيق أهداف الكارديو الخاصة بك.

# mainTextSecondOnboardingPage
source: Quick Recipes, Healthy Results
ar: وصفات سريعة، نتائج صحية

# subTextSecondOnboardingPage
source: Discover the quickest way to nutritious meals that help you stay fit and healthy.
ar: اكتشف أسرع الطرق لتحضير وجبات مغذية تساعدك على الحفاظ على لياقتك وصحتك.

# mainTextThirdOnboardingPage
source: Absolutely Free for Your Health
ar: مجاناً بالكامل لصحتك

# subTextThirdOnboardingPage
source: It’s all free! We want you to get fit and healthy, so enjoy our content at no cost.
ar: كل شيء مجاني! نريدك أن تصبح لائقًا وصحيًا، لذا استمتع بمحتوانا دون أي تكلفة.

# firstNameHint
source: Ahmed
ar: احمد

# firstNameLabel
source: First name
ar: الاسم الأول

# lastNameHint
source: Hafez
ar: حافظ

# lastNameLabel
source: Last name
ar: الاسم الأخير

# usernameLabel
source: Username
ar: اسم المستخدم

# emailLabel
source: Email
ar: البريد الإلكتروني

# passwordLabel
source: Password
ar: كلمة المرور

# forgetfield
source: Please fill in all required fields
ar: يرجى ملء جميع الحقول المطلوبة

# usernametaken
source: Username is already taken
ar: اسم المستخدم مأخوذ بالفعل

# promptTextlogin
source: Do you already have an account?
ar: هل لديك حساب بالفعل؟

# actionTextlogin
source: Log in
ar: تسجيل الدخول

# signupbutton
source: Sign up
ar: أنشاء حساب

# emailAlreadyInUse
source: The email address is already in use by another account.
ar: عنوان البريد الإلكتروني مستخدم بالفعل من قبل حساب آخر.

# invalidEmail
source: The email address is badly formatted.
ar: عنوان البريد الإلكتروني بتنسيق غير صحيح.

# weakPassword
source: The password provided is too weak.
ar: كلمة المرور المقدمة ضعيفة جدًا.

# unknownError
source: An unknown error occurred. Please try again.
ar: حدث خطأ غير معروف. يرجى المحاولة مرة أخرى.

# updateUserDetailsFailed
source: Failed to update user details. Please try again.
ar: فشل في تحديث تفاصيل المستخدم. يرجى المحاولة مرة أخرى.

# userNotFound
source: No user found for that email.
ar: لم يتم العثور على مستخدم للبريد الإلكتروني هذا.

# wrongPassword
source: Wrong password provided for that user.
ar: كلمة المرور المقدمة غير صحيحة لهذا المستخدم.

# userDisabled
source: This user has been disabled.
ar: تم تعطيل هذا المستخدم.

# tooManyRequests
source: Too many requests. Try again later.
ar: تعددت الطلبات. حاول مرة أخرى لاحقًا.

# networkRequestFailed
source: Network error. Please check your connection.
ar: خطأ في الشبكة. يرجى التحقق من اتصالك.

# operationNotAllowed
source: Sign-in method not allowed. Please enable the sign-in method in Firebase console.
ar: طريقة تسجيل الدخول غير مسموح بها. يرجى تمكين طريقة تسجيل الدخول في وحدة تحكم Firebase.

# discoverApp
source: Discover our app, it’s
ar: اكتشف تطبيقنا، إنه

source: PERSONALIZED TRAINING
ar: تدريب مخصص

source: DAILY MOTIVATION
ar: تحفيز يومي

source: HEALTHY RECIPE SUGGESTIONS
ar: اقتراحات وصفات صحية

source: CUSTOM WORKOUT PLANS
ar: خطط تمرين مخصصة

source: PROGRESS TRACKING
ar: تتبع التقدم

source: MEAL PLANNING
ar: تخطيط الوجبات

source: EXPERT TRAINING TIPS
ar: نصائح تدريبية من خبراء

source: Or login with
ar: أو تسجيل الدخول باستخدام

source: Or sign up with
ar: أو التسجيل باستخدام

source: Login successful
ar: تم تسجيل الدخول بنجاح

source: Login
ar: تسجيل الدخول

source: Welcome back
ar: مرحبًا بعودتك

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign up
ar: إنشاء حساب

source: Sign in
ar: تسجيل الدخول

# welcomeonboarding
source: Welcome to your journey toward a healthier and happier you! Our app is here to support you every step of the way with a range of free features designed to help you reach your goals effortlessly.
ar: مرحبًا بك في رحلتك نحو حياة أكثر صحة وسعادة! تطبيقنا هنا لدعمك في كل خطوة مع مجموعة من الميزات المجانية المصممة لمساعدتك في تحقيق أهدافك بسهولة.

source: Next
ar: التالي

# genderselect
source: Select Your Gender
ar: حدد جنسك

# man
source: Male
ar: ذكر

source: Female
ar: انثي

# heigh
source: What's your height?
ar: ما هو طولك ؟

source: cm
ar: سم

source: ft
ar: قدم

# weight
source: What's your weight?
ar: ما هو وزنك؟

source: kg
ar: كجم

source: lb
ar: رطل

# WeightLoss
source: Put a Short term goal
ar: ضع هدفًا قصير المدى

source: gain
ar: زيادة

source: lose
ar: فقدان

# loseorgainweight
source: You are going to
ar: سوف يكون هناك

# approximately
source: This will take approximately
ar: سوف يستغرق هذا حوالي

source: to
ar: الي

source: days
ar: ايام

# bodyfatwoman
source: Choose your body fat percentage
ar: اختاري نسبة الدهون في جسمك

# bodyfatman
source: Choose your body fat percentage
ar: اختر نسبة الدهون في جسمك

# Water
source: What Water Measurement Units do you use
ar: ما هي وحدات قياس المياه التي تستخدمها؟

# unit
source: Select unit:
ar: اختر الوحدة:

source: mL
ar: مل

# Litres
source: L
ar: لتر

source: US oz
ar: أونصة

# howmanywater
source: You will need to drink around:
ar: سوف تحتاج إلى شرب حول:

source: per day
ar: يوميا

# wakeup
source: Wake-up Time:
ar: وقت الاستيقاظ:

source: Sleep Time:
ar: وقت النوم:

# wakeupclock
source: waking time
ar: اختر وقت الاستيقاظ

# sleepingclock
source: sleeping time
ar: اختر وقت النوم

# quote
source: Water is the driving force of all nature.
ar: الماء هو القوة الدافعة لكل الطبيعة.

# quotesaider
source: - Leonardo da Vinci
ar: - ليوناردو دافنشي

# waterwidget
source: The best way to achieve your dreams is to keep them in sight. That's why you need to add this widget to your home screen.
ar: أفضل طريقة لتحقيق أحلامك هي إبقائها في الأفق. لهذا السبب تحتاج إلى إضافة هذه الأداة إلى شاشتك الرئيسية.

# addwidget
source: Add the widget
ar: اضفها الي شاشاتك الرئيسية

# setp1
source: Making your workout Routines...
ar: إعداد روتين التمارين الخاص بك...

# step2
source: Making your Nutrition...
ar: إعداد التغذية الخاصة بك...

# step3
source: Set Up Your water reminders
ar: ضبط تذكيرات المياه الخاصة بك

# motivationalText
source: Just 30 days to reach your goal, try to achieve our dream
ar: فقط 30 يومًا للوصول إلى هدفك، حاول تحقيق حلمنا

# buttonText
source: Start activating your dream
ar: ابدأ في تحقيق حلمك

# preferlanguage
source: What is your preferred language for using the app?
ar: ما اللغة التي تفضل استخدامها في التطبيق؟

source: arabic
ar: عربي

source: english
ar: انجليزي

# Restrictions
source: No Restrictions
ar: كل شئ

source: Exclude
ar: استبعاد

source: Vegetarian
ar: نباتي

source: Vegan
ar: نباتي صارم

source: Keto
ar: كيتو

# diet
source: Choose Your Dietary Preference
ar: اختر نوع النظام الغذائي الذي تفضله

# diet_selective
source: Select the diet that best suits you.
ar: حدد النظام الغذائي الذي يناسبك بشكل أفضل.

source: nothing
ar: لا شئ

source: meat
ar: لحم

source: all animal products
ar: جميع المنتجات الحيوانية

source: Carbs, sugar, grains
ar: الكربوهيدرات، السكر، الحبوب

# Goal
source: Select Your Goal
ar: اختر هدفك

source: Lose Weight
ar: خسارة الوزن

source: Maintain Weight
ar: الحفاظ على الوزن

source: Gain Weight
ar: زياده الوزن

# short_term
source: Set Your Short-Term Weight
ar: حدد وزنك على المدى القصير

source: Maintenance
ar: الحفاظ

# active_my_goal
source: I want to achieve my goal in...
ar: أريد تحقيق هدفي في...

# one_week
source: 1 week
ar: 1 أسبوع

# two_weeks
source: 2 weeks
ar: أسبوعان

# one_month
source: 1 month
ar: شهر واحد

# two_months
source: 2 months
ar: شهران

source: Custom
ar: مخصص

# recommended
source: recommended for you
ar: موصى به لك

# Bmi
source: Your BMI
ar: مؤشر كتلة الجسم (Bmi)

source: Severe Thinness
ar: نقص شديد في الوزن

source: Moderate Thinness
ar: نقص معتدل في الوزن

source: Mild Thinness
ar: نقص طفيف في الوزن

source: Normal weight
ar: الوزن الطبيعي

source: Overweight
ar: زيادة الوزن

source: Obese Class I
ar: السمنة من الفئة الأولى

source: Obese Class II
ar: السمنة من الفئة الثانية

source: Obese Class III
ar: السمنة من الفئة الثالثة

# healthylifestyle
source: Keep up the good work and maintain a healthy lifestyle!
ar: استمروا في العمل الجيد وحافظوا على نمط حياة صحي!

# severeThinnessRec
source: A healthier you is within reach! Consider consulting a healthcare professional, and explore our app's nutrition plans to support your journey.
ar: الوصول إلى حياة أكثر صحة في متناول اليد! فكر في استشارة طبيب مختص واستكشف خطط التغذية في تطبيقنا لدعم مسيرتك.

# moderateThinnessRec
source: A balanced diet can make a world of difference. Our nutrition plans are here to help you reach your ideal weight.
ar: النظام الغذائي المتوازن يمكن أن يحدث فرقًا كبيرًا. خطط التغذية الخاصة بنا ستساعدك على الوصول إلى وزنك المثالي.

# mildThinnessRec
source: Small changes can lead to great results! Try our healthy meal options to get closer to your wellness goals.
ar: تغييرات صغيرة يمكن أن تؤدي إلى نتائج رائعة! جرب خيارات وجباتنا الصحية للاقتراب من أهدافك الصحية.

# normalRec
source: You’re on the right track! Keep up the great habits and explore new ways to maintain a balanced lifestyle.
ar: أنت على الطريق الصحيح! واصل العادات الجيدة واستكشف طرقًا جديدة للحفاظ على نمط حياة متوازن.

# overweightRec
source: You're closer to a healthier weight than you think! A nutritious diet and regular exercise can make a big difference. Let’s start together!
ar: أنت أقرب إلى وزن صحي مما تعتقد! النظام الغذائي المغذي والتمارين المنتظمة يمكن أن تحدث فرقًا كبيرًا. دعنا نبدأ معًا!

# obeseClassIRec
source: With dedication and the right choices, a healthier weight is achievable. Explore our meal plans and workouts tailored to support your journey.
ar: مع الالتزام والخيارات الصحيحة، يمكن تحقيق وزن صحي. استكشف خطط الوجبات والتمارين الخاصة بنا لدعم مسيرتك.

# obeseClassIIRec
source: Your health is a priority. Our app can guide you with personalized nutrition and activity plans to get closer to your goal.
ar: صحتك هي الأولوية. يمكن لتطبيقنا أن يرشدك بخطط تغذية ونشاط مخصصة لتقترب من هدفك.

# obeseClassIIIRec
source: Together, we can make a difference in your health. Consult a healthcare provider and start with our nutrition and wellness options for a fresh start.
ar: معًا، يمكننا أن نُحدث فرقًا في صحتك. استشر مزود الرعاية الصحية وابدأ مع خيارات التغذية والعافية لدينا لبداية جديدة.

# Goall
source: Goal
ar: هدف

# Weightlose
source: weight loss
ar: فقدان الوزن

source: weight gain
ar: زيادة الوزن

source: kg/week
ar: كجم / اسبوع

source: lb/week
ar: رطل / اسبوع

source: Gradual
ar: تدريجي

source: Faster
ar: أسرع

source: Custom goal
ar: هدف مخصص

source: week
ar: اسبوع

source: weekly goal
ar: حدد هدفك الأسبوعي.

# desiredweekly
source: Enter your desired weekly weight
ar: ادخل هدفك الاسبوعي

# ex
source: Choose a custom goal like 0.75 kilograms
ar: ختر هدفًا مخصصًا مثل ٠٫٧٥ كيلو جرام

source: Cancel
ar: الغاء

# validgoal
source: Please enter a valid goal within a healthy range.
ar: يرجى إدخال هدف صالح ضمن النطاق الصحي.

# vaildnumber
source: Please enter a valid number.
ar: الرجاء إدخال رقم صالح.

source: Save
ar: حفظ

source: Target Weight
ar: الوزن المستهدف

source: Healthy range:
ar: النطاق الصحي:

# rangeweight
source: Please enter a weight within the range
ar: من فضلك أدخل الوزن ضمن نطاق

source: Enter Valid Height
ar: ادخل طول صحيح
